import React from 'react';
import PurchaseMapImg from "../../../../items/PurchaseMapimg";

const pointArray: object = {
    "연천군": "180, 51, 238, 95",
    "포천시": "257, 90, 308, 135",
    "파주시": "83, 123, 156, 174",
    "동두천시": "211, 115, 235, 132",
    "양주시": "184, 149, 217, 170",
    "의정부시": "205, 179 ,235, 194",
    "가평군": "321, 138, 374, 182",
    "고양시": "113, 205, 151, 225",
    '김포시': "33, 197, 73, 228",
    '남양주시': "260, 195, 313, 230",
    '구리시': "222, 237, 254, 250" ,
    '하남시': "256, 261, 282, 276" ,
    '양평군': "352, 259, 446, 294",
    '광주시': "280, 290 , 327, 323",
    '여주시': "403, 325, 452, 373",
    '이천시': "347, 363, 380, 389",
    '용인시': "254, 358, 300, 389",
    '안성시': "272, 429, 320, 464",
    '평택시': "166, 442, 225, 468",
    '화성시': "134, 378, 182, 420",
    '수원시': "185, 346, 211, 364",
    '오산시': "204, 388, 227, 404",
    '안산시': "129, 330, 154, 343",
    '군포시': "160, 326, 180, 338",
    '의왕시': "186, 316, 202, 328",
    '안양시': "161, 306, 180, 313",
    '과천시': "183, 289, 208, 304",
    '부천시': "101, 270, 130, 281",
    '광명시': "141, 285, 162, 295",
    '성남시': "223, 301, 250, 317",
    '시흥시': "112, 310, 140, 321"
}


function PurchaseMap() {
    return (
    <div>
        <PurchaseMapImg/>
        <map name="purchaswMap" id="purchaswMap">
            {Object.entries(pointArray).map(([key,value])=>
                <area shape="rect" coords={value} alt={key} onClick={()=>alert(`${key} 클릭!`)}/>)}
        </map>
    </div>
    );
};

export default PurchaseMap;